<template>
  <section id="company" class="about container">
    <h2 class="about__title">
      О нашей компании
    </h2>
    <p class="about__text">
      Предлагаем вам широкий спектр услуг по комплексному снабжению предприятий
      и организаций необходимым им оборудованием, техникой, инструментом, расходными материалами и
      другой продукцией технического назначения. Наша компания успешно работает на рынке снабжения
      организаций всем необходимым для эффективной работы.
    </p>
    <p class="about__text">
      Наша команда имеет большой опыт в сфере снабжения, наработанная база
      позволяют решать любые сложные задачи, а договорные отношения с производителями, позволяют
      существенно экономить. Придерживаемся таких принципов снабжения, которые позволяют максимально
      удовлетворить потребности наших клиентов в кратчайшие сроки.
    </p>
  </section>
</template>

<style lang="scss">
.about {
  align-items: center;
  text-align: center;
  padding-block: 95px 120px;

  &__title {
    margin-bottom: 45px;
    color: $accent-text;
    font-weight: 700;
    font-size: 35px;
    line-height: 40px;
  }

  &__text {
    max-width: 880px;
    color: $alter-text;

    &:not(:last-child) {
      margin-bottom: 30px;
    }
  }
}
</style>
